  [
    {
      "name": "Gollum", 
      "review":[
      "Yessss… we likes it, we loves it, the preciousss… the Retrofit Loan Calculator! It tells us if we can saves the monies, yesss, clever, clever it is! Preciousss warm, preciousss savings, all for us!",
      "But wait… what if it’s a TRICK, yesss? What if the big fat energy companieses wants to take our preciousss money anyway? We hates them! They steals from us, they lie! They says we needs to spend, spend, spend on heating! But noooo… no, we are smart now! We uses the calculator! We checks the numbers! We beats them at their own nasty, thieving game!",
      "But… but… but what if it’s not worth it? What if the numbers are wrong? What if we takes a loan and we can’t pay it back? We ends up in a deep, dark cave of DEBT, yesss! The scary interest rates, creeping, crawling, wrapping around us like SPIDERS, choking, SQUEEZING!",
      "No! No, we must trust the calculator! The preciousss calculator helps us! It shows us the truth! The savings will cover the costs, and we will never be cold again, NEVER! No more shivering in the dark, no more clutching a nasty, cold fish for warmth! We shall be toasty, we shall be victorious!",
      "Yesss, yesss, we uses the calculator, we makes the right choices, and we keeps the preciousss heat forever! And if anyone tries to take it away from us… we BITES their fingers off."
    ]},
    {
      "name": "Kier Starmer", 
      "review":[
      "Now look… what we need, fundamentally, is a pragmatic approach to home insulation. A serious plan. A credible plan. And that’s exactly what this Retrofit Loan Calculator offers—a way for ordinary working people, and indeed people from all backgrounds, to assess, in a structured and evidence-based way, whether taking out a loan for insulation is the right decision for them.",
      "And let me be absolutely clear—this is not just about warmth. It’s about fairness. It’s about ensuring that hardworking families, who have been let down time and time again, are given a genuine opportunity to lower their energy bills in a way that is both sensible and fiscally responsible. And frankly, it’s long overdue.",
      "Now, I have seen firsthand the impact of poor insulation. I’ve spoken to people up and down the country—hardworking, decent people—who tell me they are struggling with rising energy costs. And I’ve said to them, I’ve said: ‘We hear you. We understand. And that is why we support solutions like this Retrofit Loan Calculator, which empowers people to make informed choices about their homes, their finances, and indeed, their futures.’",
      "But let me also say this—this is not a substitute for proper government action. Because the real question is: why are we in this position in the first place? Why, in 2024, are we still having conversations about whether people can afford to heat their homes? It shouldn’t take a calculator to work that out.",
      "So in conclusion: this calculator is a good thing. It’s a useful thing. And I would encourage everyone to use it. Because if we are serious about tackling the energy crisis, if we are serious about insulating Britain, then these are exactly the kinds of serious, pragmatic solutions we need."
    ]},
    {
      "name": "Donald Trump",
      "review":
      [
      "Folks, let me tell you something. Nobody—NOBODY—knows more about insulation than me. I’ve built buildings, I’ve built homes, I’ve built the greatest, most beautiful walls. Some people say the Great Wall of China is the best wall—WRONG! Mine were better. And let me tell you, insulation? VERY important. Maybe the MOST important thing. I don’t think people talk about it enough, but I do. I do. Because I understand heating, I understand cooling, I understand SAVINGS. Believe me.",
      "Now, we have a problem. And the problem is BAD energy bills. Terrible! Crooked energy companies charging you too much. And why? Because they don’t care. They don’t care about YOU. They don’t care about America. They only care about ripping you off. Very bad! But you know what? I’ve got the answer. And let me tell you—it’s tremendous. It’s YUGE. It’s called the Retrofit Loan Calculator. Incredible tool. Very powerful. Probably one of the best calculators ever made, if you ask me.",
      "And what does this calculator do? It tells you how much you can save. And let me tell you, folks, it’s a LOT. It’s the best saving you’ll ever see. People are coming up to me—TEARS in their eyes—and they’re saying, ‘Sir, I used your calculator, and now my home is warm, and my energy bills are lower, and I just want to say THANK YOU, Mr. Trump, THANK YOU for making insulation great again.’ And you know what I say to them? I say, ‘It’s my pleasure. I did this for YOU.’",
      "Now, the FAKE NEWS MEDIA, they won’t tell you about this calculator. They don’t want you to know about it! They want you sitting there, cold, broke, SAD, like Sleepy Joe in a basement. But WE don’t want that. WE want WARM houses. We want STRONG houses. Houses so insulated, so ENERGY EFFICIENT, that when the radical left tries to take your heat away—because that’s what they want, folks, they want you FREEZING—your home will just be sitting there, like, ‘Nope! We’re still warm! Still saving money! Still winning!’",
      "So here’s what I need you to do. You go on the website, you use the calculator, and you SEE the numbers for yourself. And believe me, the numbers? They’re gonna be BEAUTIFUL. So beautiful, so great, you’re gonna say, ‘Wow, this is the best decision I ever made. Maybe even better than voting for Trump, but not quite.’ And you’re gonna SAVE MONEY, you’re gonna BEAT the system, and you’re gonna have the warmest, most incredible, most successful home anyone has EVER seen.",
      "So in conclusion: Use the calculator. Take control. Get warm. SAVE MONEY. And remember—nobody knows more about insulation than me, OK? NOBODY. Thank you. God bless insulation. And God bless America."
      ]
    },
    {
      "name": "Philomena Cunk",
      "review": [
        "Money. We invented it thousands of years ago because bartering was too awkward. Nobody wanted to trade two goats for a half-eaten sausage roll, so we came up with coins instead. But money has one big problem: there’s never enough of it. And that’s where loans come in. Loans are a bit like money you borrow from the future—except when you get to the future, you have to give it back. But with more money attached. Which seems unfair, since you’re the same person.",
        "Now, people have been heating their homes for centuries. The Victorians did it with coal fires, the Romans did it with underfloor heating, and cavemen did it by standing really close to other cavemen and hoping for the best. But modern heating is different—it costs money. And in Britain, it costs loads of money. Probably because it keeps escaping through all the tiny holes in our houses. Like when you put on a coat but leave the zip undone, and then act surprised when you're still cold.",
        "That’s where the retrofit loan calculator comes in. Apparently, it helps you figure out if getting a loan to insulate your home will actually save you money. Which is weird, because insulation is just stuff you put in your house to stop heat getting out. But now, it’s also a maths problem.",
        "I tried using the calculator myself. It asked me about interest rates, which I assume is how interested you are in taking out a loan. So I put ‘medium.’ Then it asked me about repayment terms, which I thought was a test of my morals, so I put ‘honest.’ And in the end, it told me I could save hundreds of pounds on my energy bills. Which is good, because I was planning to spend that money on more sausage rolls.",
        "So in conclusion: If you don’t want to freeze to death, but also don’t want to go bankrupt, this calculator is probably worth a go. It’s like a crystal ball, but for your heating bills. And unlike a crystal ball, it actually works.",
        "Probably."
      ]
    },
    {
      "name": "Brian Cox",
      "review": [
        "The universe… is vast. And yet, here we are, tiny, fragile creatures, clinging to the surface of this pale blue dot, orbiting a star, desperately trying to work out how to afford heating.",
        "But what if I told you… that we don’t have to simply accept astronomical energy bills as an inevitable truth? That, much like the great celestial bodies that follow the laws of physics, we too can harness fundamental principles to reshape our world?",
        "This is where the retrofit loan calculator enters the equation. It’s a beautiful thing, really. It takes raw data—the brutal reality of our financial cosmos—and, using mathematics, it reveals an alternative future. A future in which the energy you use is minimised, the heat you generate is retained, and the money you spend is optimised. It’s Newtonian physics for your bank account. Cause… and effect.",
        "Now, some might say, ‘But Brian, surely borrowing money to fund home insulation is a risk?’ And to that, I say: ‘Have you seen a black hole? Have you gazed into the abyss of an unchecked gas bill? That is risk!’ But this? This is a way of making sure that every unit of energy—every little molecule bouncing about inside your home—is working for you, not just leaking out into the void like background radiation from the Big Bang.",
        "So, in conclusion: The retrofit loan calculator isn’t just a tool. It’s a telescope for your finances—revealing distant, hidden futures, allowing you to plot a path through the chaos. And, much like the universe itself, it is full of possibilities. Use it. Explore the numbers. And maybe, just maybe, you’ll discover a reality where you’re not just surviving winter—you’re thriving in it."
      ]
    },
    {
      "name": "Alan Partridge",
      "review":[
        "When I first heard about this so-called ‘retrofit loan’, I thought, ‘Oh great, another financial gimmick designed to confuse and disorientate the British public, much like decimalisation, contactless payments, and the so-called ‘Greggs Vegan Sausage Roll’.",
        "But then I looked into it. And by ‘looked into it’, I mean I spent a robust 45 minutes reading a brochure in my Toyota Lexus, before concluding—this thing’s the real deal! It’s like the financial equivalent of when I upgraded from a Travelodge to a Premier Inn—same principle, but just BETTER. Warmer. More... comfortable. And who doesn’t want that?",
        "The beauty of it is, you’re paying less to owe more, while simultaneously saving so much that you’re effectively earning money. That, to me, is financial ‘A-ha!’.",
        "I’ll leave you with this: would I trust this loan over a handshake deal with a local roofer in a pub car park? 100%. Would I say it’s up there with some of the great British inventions, like the Spitfire or the toastie maker? Yes, I would. In summary: A+ work. I’d retrofit again in a heartbeat."
      ]
    },
    {
      "name": "Jeremy Clarkson",
      "review":[
        "Right. Imagine this. You’re driving a V8 supercharged Jaguar. You’re on an open road. The sun is shining. And then—suddenly—BANG! You hit an energy bill the size of the Isle of Wight and your wallet explodes into flames. This is what most people experience when winter arrives. BUT, with this retrofit loan, it’s like someone’s just handed you an Aston Martin DB5 made entirely out of free money.",
        "You see, I like this retrofit loan because it’s smart. It’s got the same level of engineering genius as a finely-tuned Ferrari, except instead of a massive engine, it’s full of maths. You take out the loan, use it to upgrade your house, and—here’s the best bit—the energy savings cover the cost of the loan. That means you get all the benefits without actually losing money. It’s essentially free horsepower for your home.",
        "Now, of course, if it were up to me, I’d solve the energy crisis by strapping jet engines to everyone’s chimneys and letting them generate their own power at Mach 3. But apparently, that’s ‘illegal’ and ‘a public safety risk’. So, until then, we have this, which is the next best thing.",
        "And unlike the Toyota Prius—which is a terrible car, by the way—this is actually good for the environment AND your bank account. In conclusion: If you DON’T take advantage of this retrofit loan, you are quite simply a blithering idiot, and I shall have no sympathy for you when your heating bill reduces you to tears."
      ]
    },
    {
      "name": "Martin Lewis",
      "review":[
        "Right. Listen up, because this is important. I see far too many people making bad financial decisions because they don’t have the right information. And this—this retrofit loan calculator—could be the difference between making a clever, informed choice and, frankly, throwing money down the drain.",
        "Now, what this tool does is simple but essential. It takes your numbers—your energy costs, loan terms, projected savings—and it tells you, in plain English, whether taking out a retrofit loan makes financial sense. No jargon, no fluff, just cold, hard, financial reality.",
        "What that means is: No more guessing. No more saying, ‘Oh, I think this will save me money in the long run.’ No. You’ll know. And if the numbers don’t work? You don’t do it. Simple.",
        "I’m telling you, I’ve seen people waste thousands on schemes they didn’t understand. This calculator stops that. It arms you with the knowledge to make a smart choice—whether that means going ahead with a loan or not.",
        "So, my verdict? If you’re even considering a retrofit loan and you don’t use this calculator, you’re doing it wrong. Get the numbers, get the facts, and make sure it’s the right decision for you."
      ]
    },
    {
      "name": "David Attenborough",
      "review":[
        "In the vast and untamed wilderness that is the modern household budget, a new tool emerges—an evolutionary marvel, perfectly adapted to help homeowners thrive in the harsh economic climate. This is the Retrofit Loan Calculator.",
        "Observe, as the homeowner, a species long burdened by rising energy costs, cautiously approaches. They are wary, unsure if they can afford to upgrade their habitat. But then—like the first primate to wield a tool—they discover the calculator. With just a few clicks, they unravel a mystery once thought impenetrable: how to insulate their dwelling, reduce energy waste, and—astonishingly—fund it all without ever being left out of pocket.",
        "Through the intricate algorithms of this powerful tool, the homeowner sees the future—a warmer, more sustainable dwelling, where heat is retained, and money is saved. No longer must they suffer through the cruel winter, wrapped in layers, huddled like penguins against the economic blizzard. No longer must they fear the arrival of the dreaded energy bill, a predator lurking in the shadows.",
        "This, dear viewer, is the beauty of nature’s most intelligent species at work—human ingenuity harnessed for survival. And so, with a few careful calculations, the homeowner takes the first step towards an energy-efficient future. A small click for them. A giant leap for home insulation."    
      ]
    },
    {
      "name": "Murray Hewitt",
      "review":[
        "Right, everyone, listen up! I've made a discovery, a real game-changer. You know how you’re always cold in winter? Freezing, like an Antarctic penguin who’s just been told to vacate its igloo? Well, I found the solution. A retrofit loan! Yes! It’s like a regular loan, except—get this—it PAYS for itself. Incredible. It’s like… uh… well, it’s like getting a free pie every week, but only paying for half a pie, but then someone ELSE pays for the half you did pay for… it’s a bit confusing, but basically, you WIN!",
        "I was sceptical at first. Thought it might be a scam, like that time Bret and Jemaine invested in that ‘Free-Range Internet’ business. But no! It’s legit. You borrow money, but then your house saves energy, and those savings cover the repayments. It’s like the financial equivalent of a boomerang—you throw money out, and it comes right back, only this time, it’s wearing a nice warm jumper.",
        "And the best part? You’re not just saving money—you’re SAVING THE PLANET! (Pause for applause.) Yes, I know! Less energy waste means less emissions, which means happier trees, which means less risk of angry tree-based retaliation in the future. And I, for one, would like to stay on the good side of the trees. They know things.",
        "Now, obviously, I tried to get Bret and Jemaine on board. I said, ‘Boys, imagine if your flat was WARM. Imagine a world where you don’t have to wear three pairs of socks indoors.’ But then Jemaine said something sarcastic about how he ‘likes being cold because it builds character,’ and Bret just stared at me in that way that makes me think he’s planning an escape. But they’ll come around. They always do.",
        "So, in summary: Retrofit Loan—yes! Big win. Do I recommend it? Absolutely. Will I be getting one? Well, not personally, because my landlord is still convinced that insulation is a ‘state of mind,’ but for everyone else? DO IT. Do it today! Your house—and the trees—will thank you!",
        "All right, great meeting, everyone. Oh, wait, was this a meeting? Jemaine? Bret? No? Okay, cool. Bye!"
      ]
    },
    {
      "name": "Hermione Granger",
      "review":[
        "Honestly, I don’t know why more people aren’t using this Retrofit Loan Calculator. It’s all just basic arithmetic. I mean, really—it’s not that different from Arithmancy, except instead of predicting the future using numbers, you’re predicting whether or not you’ll be able to afford heating next winter.",
        "So, here’s how it works: You put in your energy costs, the loan amount, the interest rate (which, by the way, isn’t that complicated to understand if you just apply yourself), and the calculator tells you if you’ll be saving more than you’re spending. Simple! Even Ron managed to do it, and he still struggles with basic household spells.",
        "And honestly, if you think about it, insulation is basically like casting Protego Totalum over your house. It keeps the warmth in, shields you from the elements, and best of all, it stops you wasting galleons on heating costs! I’d argue it’s one of the most practical forms of modern magic—well, apart from WiFi, but let’s not get into that.",
        "Anyway, the point is: If you don’t use this calculator before making a decision, that would be like brewing a potion without checking the instructions first. And do you know what happens when you don’t check the instructions? You end up with exploding cauldrons and regret. Or worse—you end up like Harry, who once spent an entire winter in a damp, freezing tent because he didn’t plan ahead.",
        "So in summary: Use the calculator. Do the maths. Insulate your house. And if you still don’t get it… well, honestly, I don’t know what else to tell you.",
        "Honestly..."
      ]
    },
    {
      "name": "Elon Musk",
      "review":[
        "Okay, so here’s the thing. Traditional home insulation? It’s outdated. It’s inefficient. It’s basically dumb insulation. What we need is smart insulation. Insulation that doesn’t just keep heat in, but optimises it. That’s why this Retrofit Loan Calculator is so important—it’s like, you know, a thermal AI for your house. It’s literally upgrading your home’s firmware.",
        "Now, some people are like, ‘Elon, why do you care about insulation?’ And the answer is simple: If we’re gonna build a self-sustaining civilization on Mars, we need to understand how to keep heat inside structures in the most efficient way possible. Earth homes leak heat. Mars homes? Can’t afford that. So yeah, I think about this a lot.",
        "Anyway, this calculator? It’s basically a simulation of optimal energy efficiency. It runs the numbers, does the math, tells you if taking out a retrofit loan makes sense. And look, I know math. I love math. Math is literally physics. So if the numbers say you save money, you probably should do it.",
        "Also, what if, like, your walls could generate energy? Like solar, but vertical. Just putting it out there.",
        "Anyway. Use the calculator. Save money. Maybe one day, retrofit a home on Mars. Cool? Cool."
      ]
    },
    {
      "name": "Jacob Rees-Mogg",
      "review":[
        "Ah, insulation. A most delightful innovation. One that has, for some mysterious reason, become a great concern to the modern working classes. I must say, in my day, we did not require such contraptions—we simply wore an additional waistcoat, sat closer to the fire, or, if times were particularly challenging, called upon one’s manservant to fan warm air towards us with a copy of The Times.",
        "However, I have recently been informed by my advisors that insulation is, in fact, rather important to those who do not inhabit country estates with drawing rooms the size of Westminster Abbey. And so, I must commend this Retrofit Loan Calculator, which provides the unlanded gentry—by which I mean you people—with a means to establish whether they can afford such luxuries as ‘not shivering’.",
        "Of course, one might reasonably ask why one should need a loan for such a thing. I, for instance, have never taken out a loan in my life—one simply inherits one’s wealth, as tradition dictates. But I understand that for the less fortunate—that is to say, everyone else—these matters require careful consideration.",
        "The calculator, I am told, provides a rather useful insight into whether a retrofit loan might be financially advantageous in the long term. This, I suppose, is preferable to the alternative, which is… remaining cold. And while I personally see no issue with a crisp indoor temperature—indeed, my father always said that a cold home ‘builds character’—I accept that not everyone wishes to develop frostbite-induced resilience.",
        "So, in summation, if one is determined to pursue insulation, and one does not have a trust fund or a generous family member named Percival, then one might indeed find this calculator a most beneficial instrument. I shall not be using it myself, of course, but I shall magnanimously endorse it for those who require it."
      ]
    },
    {
      "name": "Yoda",
      "review": [
        "Insulation strong with this one, it is.",
        "Retrofits, I have mastered, and high bills? Vanished, they have!"
      ]
    },
    {
      "name": "Gandalf",
      "review": [
        "You shall not pass… on this opportunity!",
        "This retrofit loan calculator is pure wizardry—transforming energy bills into mere shadows."
      ]
    },
    {
      "name": "Albert Einstein",
      "review": [
        "I formulated E=mc², yet even I can’t explain how this loan calculator turns debt into savings faster than light.",
        "Absolute relativity in action!"
      ]
    },
    {
      "name": "Benjamin Franklin",
      "review": [
        "They say a penny saved is a penny earned.",
        "With this retrofit loan calculator, I’ve practically invented free warmth—no kite required!"
      ]
    },
    {
      "name": "Nikola Tesla",
      "review": [
        "I dreamed of harnessing lightning; instead, I found a retrofit loan that electrifies your savings.",
        "The future is now, and it’s shockingly efficient!"
      ]
    },
    {
      "name": "Marilyn Monroe",
      "review": [
        "Diamonds may be forever, but this retrofit loan makes my bills disappear like bad publicity.",
        "I never felt so warm and glamorous!"
      ]
    },
    {
      "name": "Captain Kirk",
      "review": [
        "To boldly go where no homeowner has gone before, I embraced this retrofit loan.",
        "Now my energy bills are lost in the final frontier!"
      ]
    },
    {
      "name": "Sherlock Holmes",
      "review": [
        "Elementary, my dear homeowner.",
        "With this retrofit loan, the curious case of disappearing energy bills is solved.",
        "The game is afoot—into savings!"
      ]
    },
    {
      "name": "Darth Vader",
      "review": [
        "I find your lack of retrofitted insulation... disturbing.",
        "With this loan, the dark side of high bills is vanquished by sheer, toasty power!"
      ]
    },
    {
      "name": "Danny Dyer",
      "review": [
        "Listen ‘ere, mate. I used to get mugged off by my energy bills every winter.",
        "Then this retrofit loan rocked up, slapped ‘em in the face, and said, ‘Jog on, son!’ Absolute geezer of a scheme."
      ]
    },
    {
      "name": "David Dickinson",
      "review": [
        "This retrofit loan? Cheap as chips!",
        "And the best part? No dodgy antiques, no rip-offs—just straight-up, warm-home bargains.",
        "A real bobby dazzler!"
      ]
    },
    {
      "name": "Phil Mitchell",
      "review": [
        "I was gonna have a word with my energy bills, proper East End style.",
        "But then I found this retrofit loan—now I’m as warm as The Vic on a Friday night, and I didn’t even ‘ave to get the boys involved."
      ]
    },
    {
      "name": "Richard Madeley",
      "review": [
        "Now, I’m no expert, but this retrofit loan is like if you crossed Carol Vorderman with a central heating system.",
        "It’s clever, it’s warm, and frankly, I’d vote for it if it ran for Prime Minister."
      ]
    },
    {
      "name": "Katie Price",
      "review": [
        "People always say, ‘Katie, you’ve had so much work done!’",
        "And I say, ‘Yeah, well, now my house has too!’",
        "This retrofit loan gave it the glow-up of the century.",
        "Energy bills? Over, babes."
      ]
    },
    {
      "name": "Craig Revel Horwood",
      "review": [
        "Darling, before my retrofit loan, my heating situation was dismal.",
        "But now? Warm, cost-effective, and FAB-U-LOUS.",
        "Energy bills? A solid zero from me."
      ]
    },
    {
      "name": "Nigel Farage",
      "review": [
        "I was about to blame the EU for my high heating bills, but turns out, all I needed was this retrofit loan.",
        "Honestly, I hate how good it is."
      ]
    },
    {
      "name": "Rylan Clark",
      "review": [
        "Before this loan, I was FREEZIN’, babes.",
        "My heating bill was more shocking than my old X Factor audition.",
        "But now? My house is as warm as my spray tan, and I’m LIVING for it."
      ]
    },
    {
      "name": "David Brent",
      "review": [
        "Some people spend their whole lives working hard just to throw money at bills.",
        "Me? Nah. I work smart. I got a retrofit loan.",
        "That’s called big-picture thinking.",
        "Financial chillaxation. It’s the future, mate."
      ]
    }    
  ]